{"pages":[],"posts":[{"title":"my first blog","text":"一次拍到的星空 在张掖的夜晚看到了这辈子都没看到过的银河，真的很震撼，一抬头天上全是星星。 拍星星拍到了凌晨两点多，勉强凑成了一段延时 以下是视频","link":"/2019/08/08/my-first-blog/"},{"title":"用手机拍星空延时教程","text":"前几天我发了个星空延时的视频，今天就来发个关于用手机拍星空延时的教程把。 准备阶段材料 ⬜一个带专业模式的手机 ⬜三脚架一个 ⬜充电宝一个（你不想拍到中途就没电吧） 星图APP可以下载一个看星空的APP，我用的是星图 提取码（sxx4），可以帮你找到北极星，银河的位置，装逼利器q(≧▽≦q) 地点选择选地点重的就是 天时地利人和 你需要一个光污染小的地方，当然如果实在找不到那种光污染贼小的地方，找个肉眼能看到比较多星星的地方也行，手机拍出的星星也许会超出你的想象，做个星轨也不错。 关于光污染你可以看下光污染地图，看下你附近有没有什么地方光污染比较小（一定要注意安全，光污染小的地方一般都人烟稀少，我去我国大西北旅游时都只在张掖七彩丹霞住宿时看到了银河）,地图上颜色越浅光污染越小。 开始拍摄参数 曝光时间：16 s ISO：3200 色温：3600 对焦：无限远 所有参数都可以根据实际情况调整，亮了就降低曝光时间，ISO，颜色太蓝就调高色温，一般拍星空色温都是在白炽灯附近。 找一个视野开阔的地方，架好三脚架，边拍边调整，找到好的角度，就可以开始拍了。 (拍星轨的话对着北极星拍出的星轨是绕着北极星转的） 自动拍摄脚本因为我的手机没有拍星空延时的功能，所以只能一张一张的拍照片，再后期合成为视频。如果视频帧率为25帧/秒的话，25张照片就能合成为一秒视频，具体拍多少张照片你可以自己算一算。 我用的自动化脚本是Auto.js（提取码：e8uz），需要自己编写脚本来实现自动快门 我的代码如下，你可以直接复制（小米8用户），其他手机或许不兼容，你可以看这篇文章自己调整一下cv，主要是调整快门的坐标，我也是跟那位大佬学的（修改了部分代码） 1234567891011sleep(1000)var jg = dialogs.input(\"输入快门时间＋间隔\")var cs = dialogs.input(\"输入拍照的张数\")sleep(500)for (var i = 0; i &lt; cs; i++) {​ click(540, 1975)​ sleep(jg * 1000)}dialogs.alert(\"拍摄完成\",\"点击确定退出\") 使用步骤 打开Auto.js的悬浮窗 打开相机，调到专业模式 点击悬浮窗，然后点第一个按钮，运行你的脚本 输入快门时间+间隔，其实就是间隔多少秒拍摄一次 输入拍照张数，然后就等它拍摄完成吧，完成后会弹出对话框。 不过我一般是输入1000张，拍到不想拍了就手动停止脚本🤣🤣🤣 注意根据我的经验，拍银河可以早点开始拍，大概凌晨12左右吧，因为就算天气很好，后半夜也有可能出来月亮，就拍不了了，可以用星图看看月亮是不是有出来的趋势。 软件下载星图：https://pan.baidu.com/s/1fWe6qcP64LFgpEhpQQyFIQ 提取码：sxx4 Auto.js：https://pan.baidu.com/s/1ZqKTSJ3fm32obqocm3Si-w 提取码：e8uz 到这里拍摄环节就完成了，后期部分在下一篇文章，886！","link":"/2019/08/15/shooting-stars/"},{"title":"pr合成延时摄影+星轨教程","text":"这篇文章是关于pr的后期合成延时摄影+星轨教程 星空延时教程 打开premier，新建项目，然后在素材箱上右键导入，选择第一张照片，然后勾选图像序列，点击打开 。（如果你的素材名称不连续，是无法导入所有图片的，推荐使用批量重命名软件重命名一下，后面我会提到) 把刚导入的素材拖到序列中，然后就成功啦（完） 如果你觉得视频速度太快，可以在速度/持续时间里改一下速度，调到你喜欢的速度就行了。 最后可以调一下色，切换到颜色工作区，新建一个调整图层，拖到右侧视频的上方，然后在右侧凭感觉调颜色吧。 关于重命名可以下载一个批量重命名的软件，Windows直接批量重命名会加上括号，premiere识别不了，我用的是ReNamer pro 提取码：（riuz）。 打开ReNamer pro，点击添加规则–&gt;序列化，勾选 替换当前名称 –&gt;保存规则 然后全选所有图片，按住第一个图片把它们拖拽到ReNamer中（一定要从第一张图片拖，不然顺序会变） 点击上方的重命名就行了。 星轨教程1.第一步和前面的步骤一样，先把要做成星轨的照片合成为视频2.给该视频添加一个残影视频效果，然后在效果控件中修改参数： 残影数量：等于你导入的照片数残影运算符：改为最大值衰减值：衰减值越小，越有一种流星的效果，一般0.9~1.0之间就行了 3.一样的可以给视频调个色4.文件–&gt;导出视频,最后就大功告成啦！是不是很简单🐪","link":"/2019/08/16/pr-Time-lapse/"}],"tags":[{"name":"摄影","slug":"摄影","link":"/tags/摄影/"},{"name":"教程","slug":"教程","link":"/tags/教程/"}],"categories":[{"name":"摄影","slug":"摄影","link":"/categories/摄影/"},{"name":"教程","slug":"教程","link":"/categories/教程/"}]}